field = [
    ['X', '', ''],
    ['', 'X', ''],
    ['', '', 'X']
]
symb = []
w_cords = [
    ((0, 0), (0, 1), (0, 2)),
    ((1, 0), (1, 1), (1, 2)),
    ((2, 0), (2, 1), (2, 2)),
    ((0, 0), (1, 0), (2, 0)),
    ((0, 1), (1, 1), (2, 1)),
    ((0, 2), (1, 2), (2, 2)),
    ((0, 0), (1, 1), (2, 2)),
    ((0, 2), (1, 1), (2, 0))
]

for cords in w_cords:
    print('-----')
    for c in cords:
        symb.append(field[c[0]][c[1]])
        print(symb)
    if symb == ["X", "X", "X"]:
        print("Выиграл крестик!")
        break
    if symb == ["0", "0", "0"]:
        print("Выиграл нолик!")
        break
    if len(symb) == 3:
        symb.clear()
